Revit 2024 API
BuiltInFailures.SystemsFailures Class
 Failures about System.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class SystemsFailures
Visual Basic
Public NotInheritable Class SystemsFailures
Visual C++
public ref class SystemsFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SystemsFailures
See Also
BuiltInFailures.SystemsFailures Members
Autodesk.Revit.DB Namespace